[
  {
    "id": "d9c20a5f-2b20-46e4-acfa-137b86ca0249",
    "title": "Joshua McFadden at The Brattle Theatre",
    "description": "Harvard Book Store welcomes Joshua McFadden—James Beard Award–winning author of Six Seasons: A New Way with Vegetables—for a discussion of his follow-up cookbook, Six Seasons of Pasta: A New Way with Everyone's Favorite Food. There are two ticket options for this event. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event.",
    "start_datetime": "2025-11-19 18:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Brattle Theatre",
    "street_address": "40 Brattle St",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Ticketed",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/joshua-mcfadden",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711077",
    "last_updated": "2025-11-19 19:59:04.711086",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "08f433aa-f4f5-460a-ab0f-42b7bda1f517",
    "title": "W. David Marx at Harvard Book Store",
    "description": "Harvard Book Store welcomes W. David Marx—Tokyo-based culture writer and author of Status and Culture—for a discussion of his new book, Blank Space: A Cultural History of the Twenty-First Century. He will be joined in conversation by Josh Lambert—Sophia Moses Robison Professor of Jewish Studies and English, and director of the Jewish Studies Program, at Wellesley College. An NPR Most Anticipated Book of Fall 2025 A revealing exploration of a quarter century of cultural stagnation, examining the commercial and technological forces that have come to dominate contemporary culture—from music and fashion to art, film, TV, and beyond. Over the past twenty-five years, pop culture has suffered from a perplexing lack of reinvention. We’ve entered a cultural “blank space”—an era when reboots, rehashes, and fads flourish, while bold artistic experimentation struggles to gain recognition. Why is risk no longer rewarded, and how did playing it safe become the formula for success? Acclaimed cultural historian W. David Marx sets out to uncover the answers.",
    "start_datetime": "2025-11-19 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "music",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/w-david-marx",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711143",
    "last_updated": "2025-11-19 19:59:04.711143",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "27056682-70af-4ff6-8fd3-1ce674a6bd3f",
    "title": "Oyinkan Braithwaite at Harvard Book Store",
    "description": "Harvard Book Store welcomes Oyinkan Braithwaite—London-based author of My Sister, the Serial Killer—for a discussion of her highly anticipated new novel, Cursed Daughters. She will be joined in conversation by Hanna Halperin—award-winning author of the novel Something Wild. A MOST ANTICIPATED BOOK: New York Times, Washington Post, People, Goodreads, E! News, Kirkus, LitHub, Book Riot A young woman must shake off a family curse and the widely held belief that she is the reincarnation of her dead cousin in this wickedly funny, brilliantly perceptive novel about love, female rivalry, and superstition from the author of the smash hit My Sister, the Serial Killer (“A bombshell of a book... Sharp, explosive, hilarious'—New York Times)",
    "start_datetime": "2025-11-20 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/oyinkan-braithwaite",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711174",
    "last_updated": "2025-11-19 19:59:04.711175",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "88379fb3-e998-4d16-ba34-65b7a2323586",
    "title": "Kareem Khubchandani at Harvard Book Store",
    "description": "Harvard Book Store welcomes Kareem Khubchandani—also know by his drag persona LaWhore Vagistan, he's the author of Decolonize Drag and Associate Professor and Interim Chair of Theatre, Dance, and Performance Studies, and Associate Professor of Studies in Race, Colonialism, and Diaspora at Tufts University—for a discussion of his new book, Lessons in Drag: A Queer Manual for Academics, Artists, and Aunties. He will be joined in conversation by Durba Mitra—feminist historian and theorist and author of the award-winning book Indian Sex Life: Sexuality and the Colonial Origins of Modern Social Thought. Scholarship and performance combine to show how drag can be a blueprint for critique, care, teaching, and worldmaking. Lessons in Drag brings to life a vibrant and thought-provoking dialogue between scholar Kareem Khubchandani and his drag persona LaWhore Vagistan. Beginning with an intimate interview, the book unfolds in alternating chapters where the two exchange insights, stories, and critiques. Khubchandani delves into the lessons LaWhore’s drag practice offers about academia—shaping his approaches to research, teaching, and writing—while Vagistan reveals how Khubchandani’s scholarship influences her performances, inspiring her understanding of fashion, music, divas, and aunties. Together, their reflections and conversations weave a compelling tapestry of drag’s instructive power. Witty, bold, and deeply personal, Lessons in Drag is both an invitation to explore drag as a practice and a celebration of its transformative potential. “Shrewdly defying the conventions that often keep academic texts dry and sequestered . . . Khubchandani and Vagistan model a way to integrate research and performance.” -Hyperallergic",
    "start_datetime": "2025-11-21 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "music",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/kareem-khubchandani",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711202",
    "last_updated": "2025-11-19 19:59:04.711202",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "a027f71d-cfbf-4f8d-badc-c7e2ff772d7d",
    "title": "Congressman Jim Clyburn at First Parish Church",
    "description": "Harvard Book Store welcomes Congressman Jim Clyburn―who has served more than thirty years as the Congressman representing South Carolina’s 6th Congressional District in the U.S. House of Representatives, where he previously served as Majority Whip―for a discussion of his new book, The First Eight: A Personal History of the Pioneering Black Congressmen Who Shaped a Nation. He will be joined in conversation by Marla F. Frederick―Dean of Harvard Divinity School, the John Lord O’Brian Professor of Divinity, Professor of Religion and Culture, and Professor of African and African American Studies, all at Harvard University. There are two ticket options for this event. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event.",
    "start_datetime": "2025-11-22 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "First Parish Church, Barn Room",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Ticketed",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/jim-clyburn",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711226",
    "last_updated": "2025-11-19 19:59:04.711226",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "c130c202-868b-4109-85d1-89efd106b725",
    "title": "November's Harvard Square Book Circle",
    "description": "This month we're discussing Winter in the Blood by James Welch. Don't forget each book we discuss is part of our featured Select 70 for frequent buyer members. The Book Circle is Harvard Book Store's monthly book club open for members of the community to meet and discuss a thoughtfully selected book. We’ll meet in the third room of the store from 6–7:30 PM. Registration is not required and no commitment is necessary. We love new participants! If you are interested in joining the Book Circle's email list, sign up through this form.",
    "start_datetime": "2025-11-23 18:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/novembers-harvard-square-book-circle",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711255",
    "last_updated": "2025-11-19 19:59:04.711255",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "c96effe9-1f7c-458c-9487-d0efb88e1a33",
    "title": "Max Perry Mueller at Harvard Book Store",
    "description": "Harvard Book Store and Harvard University's American Studies program welcome Max Perry Mueller—associate professor in the Department of Classics and Religious Studies at the University of Nebraska–Lincoln and author of the award-winning book Race and the Making of the Mormon People—for a discussion of his new book Wakara's America: The Life and Legacy of a Native Founder of the American West. He will be joined in conversation by Philip J. Deloria—Leverett Saltonstall Professor of History at Harvard University, and the author of Playing Indian, Indians in Unexpected Places. The forgotten life and complex legacies of Wakara, the mighty, once-notorious Native leader whose battles and conquests shaped the American West—a “sobering reassessment” that centers the “disruptive and violent influences of colonialism”. (Ned Blackhawk, National Book Award–winning author of The Rediscovery of America) The Native American leader Wakara (ca. 1815–1855) was among the most influential and feared men in the nineteenth-century American West, famed as a fierce warrior, a merciless trader of Indian slaves, and history’s greatest horse thief. In Wakara's America, historian Max Perry Mueller illuminates Wakara’s complex and sometimes paradoxical story, revealing a man who both helped build the settler American West and defended Native sovereignty. Wakara was baptized a Mormon and allied with Mormon settlers against other Indians to seize large parts of modern-day Utah. Yet a pan-tribal uprising against the Mormons that now bears Wakara’s name stalled and even temporarily reversed colonial expansion. Through diplomacy and through violence, Wakara oversaw the establishment of settlements, built new trade routes, and helped create the boundaries that still define the region. Drawing together deep archival research with Native oral histories, archaeology, geology, and ecology, Wakara's America offers an innovative new vision of the history of the American West with Native people at its center",
    "start_datetime": "2025-11-24 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/max-perry-mueller",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711273",
    "last_updated": "2025-11-19 19:59:04.711273",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "49714e01-c777-42da-aba7-74488071f7ef",
    "title": "Carla Kaplan at Harvard Book Store",
    "description": "Harvard Book Store welcomes Carla Kaplan—Davis Distinguished Professor of American Literature at Northeastern University, and author of seven books, including Miss Anne in Harlem and Zora Neale Hurston—for a discussion of her new book Troublemaker: The Fierce, Unruly Life of Jessica Mitford. She will be joined in conversation by Margaret Burnham—University Distinguished Professor of Law at Northeastern University and author of By Hands Now Known: Jim Crow’s Legal Executioners. Troublemaker tells the wild and unlikely story of Jessica Mitford, fifth of the six famous Mitford Girls, a British aristocrat-turned-American Communist, famous for exposés like The American Way of Death; this biography brings her astonishing self-transformation to life with a riveting, often hilarious account of trading wealth and status for a life of radical activism. Who could predict that a British aristocrat would so energize American antifascist and civil rights struggles that Time magazine would crown her “Queen of the Muckrakers”? Jessica Mitford, always known as Decca, was brought up by an eccentric English family to marry well and reproduce her wealth and privilege, not to advocate for the rights of others. Her beautiful sisters have been subjects of books and movies dedicated to their naughty, glamorous lives. Decca ran away to America to forge a rebel’s life. As this richly researched book details, Decca broke the Mitford mold. Instead of settling for life as a professional Beauty, she fought fascism in the Spanish Civil War, became an American Communist and pioneered witty, hugely popular journalism, including her 1963 blockbuster The American Way of Death. Decca dedicated her life to social justice and proved herself an immensely effective ally, but she also injected laughter into all her political work, annoying some activists with her relentless antics but encouraging many others to find joy in the struggle. From famed baby doctor Benjamin Spock to best friend Maya Angelou, her",
    "start_datetime": "2025-12-01 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/carla-kaplan",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711292",
    "last_updated": "2025-11-19 19:59:04.711292",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "103b032a-6350-4a01-af20-8b3dd4cc469f",
    "title": "Abigail Hing Wen at The Signet Society",
    "description": "Harvard Book Store welcomes Harvard alumna Abigail Hing Wen—tech leader, New York Times bestselling author of the Loveboat,Taipei series, and executive producer of the Paramount+ book-to-film adaptation Love In Taipei, now on Netflix—for a discussion of her New York Times bestselling middle-grade novel The Vale, which explores the nature of human-AI interaction, the ethics and possibilities of new technology, how children and adults can use technology responsibly, and the ways AI can change human lives. During the presentation, Abigail Hing Wen will share from her live action/animation short film prequel The Vale—Origins, starring three-time Tony Award winner Lea Salonga, along with behind-the-scenes materials and a discussion of the book. This event is perfect for parents, middle-grade readers, and anyone interested in AI. RSVP for free to this event or choose the \"Book-Included\" ticket to reserve a copy of The Vale and pick it up at the event. Note: Books bundled with tickets may only be picked up at the venue the night of the event, and cannot be picked up in-store beforehand. Ticket holders who purchased a book-included ticket and are unable to attend the event will be able to pick up their book at Harvard Book Store up to 30 days following the event. This offer expires after 30 days. Please note we cannot guarantee signed copies will be available to ticket holders who do not attend the event.",
    "start_datetime": "2025-12-02 18:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "The Signet Society",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Ticketed",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/abigail-hing-wen",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711306",
    "last_updated": "2025-11-19 19:59:04.711306",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  },
  {
    "id": "604b3f54-b789-419d-b2e9-52f1d0fcaee9",
    "title": "Sven Beckert at Harvard Book Store",
    "description": "Harvard Book Store welcomes Sven Beckert—Laird Bell Professor of History at Harvard University and author of the acclaimed book Empire of Cotton—for a discussion of his new book Capitalism: A Global History. He will be joined in conversation by Manisha Sinha—the Draper Chair in American History at the University of Connecticut and Past President of the Society for Historians of the Early American Republic. A landmark event years in the making, a brilliant global narrative that unravels the defining story of the past thousand years of human history No other phenomenon has shaped human history as decisively as capitalism. It structures how we live and work, how we think about ourselves and others, how we organize our politics. Sven Beckert, author of the Bancroft Prize–winning Empire of Cotton, places the story of capitalism within the largest conceivable geographical and historical framework, tracing its history during the past millennium and across the world. An epic achievement, his book takes us into merchant businesses in Aden and car factories in Turin, onto the terrifyingly violent sugar plantations in Barbados, and within the world of women workers in textile factories in today’s Cambodia. Capitalism, argues Beckert, was born global. Emerging from trading communities across Asia, Africa, and Europe, capitalism’s radical recasting of economic life rooted itself only gradually. But then it burst onto the world scene, as a powerful alliance between European states and merchants propelled them, and their economic logic, across the oceans. This, Beckert shows, was modern capitalism’s big bang, and one of its epicenters was the slave labor camps of the Caribbean. This system, with its hierarchies that haunt us still, provided the liftoff for the radical transformations of the Industrial Revolution. Fueled by vast productivity increases along with coal and oil, capitalism pulled down old ways of life to crown itself the defining force of the modern world. This epic d",
    "start_datetime": "2025-12-02 19:00:00",
    "end_datetime": null,
    "all_day": false,
    "venue_name": "Harvard Book Store",
    "street_address": "1256 Massachusetts Ave",
    "city": "Cambridge",
    "state": "MA",
    "zip_code": "02138",
    "latitude": null,
    "longitude": null,
    "category": "arts and culture",
    "tags": [],
    "age_restrictions": null,
    "cost": "Free",
    "registration_required": false,
    "source_url": "https://www.harvard.com/event/sven-beckert25",
    "source_name": "Harvard Book Store",
    "scraped_at": "2025-11-19 19:59:04.711321",
    "last_updated": "2025-11-19 19:59:04.711321",
    "contact_email": null,
    "contact_phone": null,
    "website_url": null,
    "image_url": null,
    "recurring_pattern": null
  }
]